Revit 2027 API
ElementSet.Contains Method
Tests for the existence of an element within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Element item
)
Public Overridable Function Contains (
	item As Element
) As Boolean
public:
virtual bool Contains(
	Element^ item
)
abstract Contains :
        item : Element -> bool
override Contains :
        item : Element -> bool
Parameters
item Element
The element to be searched for.
Return Value
Boolean
The Contains method returns True if the element is within the set, otherwise False.
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace